import java.time.LocalDateTime;

public class Seminar_Java1 {
    public static void main(String[] args) {
        System.out.println(LocalDateTime.now());
    }
}
// Написать программу, которая запросит пользователя ввести
// <Имя> в консоли.
// 📌 Получит введенную строку и выведет в консоль сообщение
// “Привет, <Имя>!”